# GetProductListEntryName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..GetProductListEntryName Method
FabricationPart Class See Also
---
Gets the specified product list entry name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Release
# Syntax
C#
---
```text
public string GetProductListEntryName(
	int index
)
```

Visual Basic
---
```text
Public Function GetProductListEntryName ( _
	index As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetProductListEntryName(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The product entry index.
# ### Return Value
Returns the specified product entry name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The product entry index is not larger than 0 and less than GetProductCount. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace